groovy-xml/src/test/resources/soap2.xml

<e:Envelope
        xmlns:e="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:w="http://weather"
        xmlns:h="http://help.weather">
  <e:Header/>
  <e:Body>
    <w:GetWeather>
      <h:CityName>Vladimir</h:CityName>
      <h:CountryName>Russian Federation</h:CountryName>
    </w:GetWeather>
  </e:Body>
</e:Envelope>
